atmosphere/tutorials/ce1/02-bubble_250m/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
   top
    {
         type            calculated;
         value           $internalField;
    }
    bottom
    {
         type            calculated;
         value           $internalField;
    }
    left
    {
         type            calculated;
         value           $internalField;
    }
    right
    {
         type            calculated;
         value           $internalField;
    }
    frontandback
    {
         type            empty;
    }
}


// ************************************************************************* //
