atmosphere/tutorials/ce1/02-bubble_250m/0/ph_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
800
(
-57874.9
-57874.5
-57873.6
-57872.4
-57870.9
-57869.4
-57867.9
-57866.5
...
)
;

boundaryField
{
    top
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
20
(
-2.18649
-2.18649
-2.18649
-2.18649
-2.18649
-2.18648
-2.18648
-2.18648
-2.18647
-2.18647
-2.18646
-2.18646
-2.18646
-2.18645
-2.18645
-2.18645
-2.18644
-2.18644
-2.18644
-2.18644
)
;
        value           nonuniform List<scalar> 
20
(
-71121.1
-71121.2
-71121.2
-71121.2
-71121.2
-71121.3
-71121.3
-71121.4
-71121.4
-71121.5
-71121.5
-71121.6
-71121.6
-71121.7
-71121.7
-71121.8
-71121.8
-71121.8
-71121.8
-71121.8
)
;
    }
    bottom
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
20
(
-0.0482576
-0.0482581
-0.0482591
-0.0482605
-0.0482622
-0.0482639
-0.0482656
-0.0482672
-0.0482686
-0.0482698
-0.0482708
-0.0482717
-0.0482725
-0.0482731
-0.0482736
-0.048274
-0.0482743
-0.0482746
-0.0482747
-0.0482748
)
;
        value           nonuniform List<scalar> 
20
(
-57881
-57880.5
-57879.6
-57878.4
-57876.9
-57875.4
-57873.9
-57872.6
-57871.4
-57870.3
-57869.4
-57868.6
-57867.9
-57867.4
-57867
-57866.6
-57866.3
-57866.1
-57866
-57865.9
)
;
    }
    left
    {
        type            fixedFluxPressure;
        gradient        uniform -0;
        value           nonuniform List<scalar> 
40
(
-57874.9
-57887.9
-57925.9
-57988.2
-58074.1
-58183
-58314.1
-58466.7
...
)
;
    }
    right
    {
        type            fixedFluxPressure;
        gradient        uniform -0;
        value           nonuniform List<scalar> 
40
(
-57859.9
-57871.9
-57907.4
-57966
-58047
-58149.9
-58274.1
-58419
...
)
;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
